app/controllers/admin/order_codes_controller.rb

  def create
    @order_code = FreeNameframeCode.new(params[:free_nameframe_code])
    if @order_code.save
---
INSERT INTO `free_nameframe_codes` (`start_date`, `end_date`, `updated_at`, `discount`, `code`, `users_quantity`, `created_at`) VALUES('2010-09-13', '2010-09-20', '2010-09-14 02:41:27', 10.0, 'rebe', 5, '2010-09-14 02:41:27')