app/controllers/admin/orders_controller.rb

SELECT * FROM `checkouts` WHERE (`checkouts`.`archived` = '0') ORDER BY status ASC LIMIT 0, 16
---
  def index
    @perpage=16
    @orders = Checkout.show_asc.archived('0').paginate :page => params[:page], :per_page => @perpage