app/controllers/assets_controller.rb

SELECT * FROM `nameframes` WHERE (`nameframes`.`uuid` = 'c2d12747-2c09-4fc8-889f-7397a62bfc4c') LIMIT 1
SELECT * FROM `font_types` WHERE (`font_types`.`name` = 'porkys') LIMIT 1
SELECT * FROM `photos` WHERE (`photos`.nameframe_id = 5)
UPDATE `nameframes` SET `font_id` = 3, `updated_at` = '2010-09-28 01:53:36' WHERE `id` = 5
---
  def select_font_ajax
    @nameframe = Nameframe.find_by_uuid(session[:uuid])
    if @nameframe
      @nameframe.font = FontType.find_by_name(params[:font])
      @nameframe.uploaded_images.each{ |image| image.photo_customizations.each{ |customization| customization.destroy } }
      session[:photo_customizations] = nil
      @nameframe.flex_address = nil
      if @nameframe.save

SELECT * FROM `nameframes` WHERE (`nameframes`.`uuid` = 'e28195ce-1037-467b-b565-247247279523') LIMIT 1
---
  def checkout_ajax
    @nameframe = Nameframe.find_by_uuid(session[:uuid])

SELECT * FROM `font_types`
---
  def select_font
    if session[:uuid].nil?
      if params[:name_selection].blank?
        session[:display_error] = true
        redirect_to root_path
        return
      else
        session[:uuid] = UUIDTools::UUID.random_create.to_s
        @nameframe = Nameframe.new_with_default_values(:uuid => session[:uuid], :selected_text => params[:name_selection])
      end
    else
      if !params[:name_selection].blank?
        @nameframe = Nameframe.new_with_default_values(:uuid => session[:uuid], :selected_text => params[:name_selection])
       else
         @nameframe = Nameframe.find_by_uuid(session[:uuid])
      end

    end
    if @nameframe.nil? || !@nameframe.save
      session[:display_error] = true
      redirect_to root_path
      return
    else
      @header_image = "frame_grace_03.gif"
      @header_image_text = "Choose this font (Serpentine) or any of the other fonts you see listed below."
      @nameframe.builder
      @image_name = @nameframe.get_image_path
      @cost = @nameframe.calculate_cost
      @fonts = FontType.all