app/controllers/checkout_controller.rb

  def checkout
    if session[:uuid]
      @nameframe = Nameframe.find_by_uuid(session[:uuid])
      @nameframe.without_images = true if @nameframe.flex_address.nil?
      @nameframe.save
---
SELECT * FROM `nameframes` WHERE (`nameframes`.`uuid` = 'e28195ce-1037-467b-b565-247247279523') LIMIT 1
UPDATE `nameframes` SET `without_images` = 1, `updated_at` = '2010-09-13 23:09:14' WHERE `id` = 1

  def submit_order
    logger.debug "----------- test 111"
    #First, check the session and the nameframe
    @nameframe = Nameframe.find_by_uuid(session[:uuid])
---
SELECT * FROM `nameframes` WHERE (`nameframes`.`uuid` = '9f7476b9-1b3e-440e-bb08-58317fccdd34') LIMIT 1

                      )

    #Then try to check the data in the models
    unless @billing_address.save && @shipping_address.save
---
INSERT INTO `addresses` (`city`, `updated_at`, `zip`, `shipping_price`, `country`, `address_1`, `address_2`, `first_name`, `user_id`, `last_name`, `state`, `created_at`) VALUES('casas', '2010-10-02 05:22:37', '23456', NULL, 'USA', 'aasasa', '', 'torres', NULL, 'oma', 'AL', '2010-10-02 05:22:37')


    total = nameframe_cost + shipping_cost + tax

    @free_nameframe_code = FreeNameframeCode.find_by_code(params[:how_did_you_hear_about_us])
---
SELECT `free_nameframe_codes`.id FROM `free_nameframe_codes` WHERE (`free_nameframe_codes`.`code` = BINARY 'chula' AND `free_nameframe_codes`.id <> 2) LIMIT 1

        @checkout.authorization = "FREE"
        @checkout.transaction = "1234"

        @checkout.save
---
INSERT INTO `checkout_transactions` (`message`, `avs_postal_match`, `remote_ip`, `cc_number`, `updated_at`, `transaction`, `checkout_id`, `response_reason_code`, `cvv_message`, `response_code`, `avs_message`, `avs_result_code`, `success`, `authorization`, `cvv_code`, `created_at`, `avs_street_match`) VALUES('Credit card number is required', 'Y', '127.0.0.1', NULL, '2010-10-02 05:25:09', '0', NULL, '33', NULL, 3, 'Postal code matches, but street address not verified.', 'P', 0, '0', NULL, '2010-10-02 05:25:09', 'N')
INSERT INTO `checkouts` (`tax`, `status`, `shipping_address_id`, `updated_at`, `transaction`, `card_type`, `gift_to`, `gift_from`, `billing_address_id`, `nameframe_cost`, `total`, `shipping_type`, `gift_message`, `nameframe_id`, `archived`, `authorization`, `user_id`, `order_number`, `shipping_cost`, `created_at`, `email`) VALUES(0.0, 1, 54, '2010-10-02 06:27:34', '1234', 'visa', '', '', 53, 54.95, 0.0, 'ground', '', 46, 0, 'FREE', NULL, NULL, 6.95, '2010-10-02 06:27:34', 'torres@vulcanik.com')

          RAILS_DEFAULT_LOGGER.info("********************************************************************")
          RAILS_DEFAULT_LOGGER.info("Exception : #{e}")
          RAILS_DEFAULT_LOGGER.info("********************************************************************")
          @billing_address.destroy
          @shipping_address.destroy
          @marketing_answer.destroy if @marketing_answer
          @checkout.destroy
---
DELETE FROM `addresses` WHERE `id` = 5
DELETE FROM `checkouts` WHERE `id` = 1

  def calculate_costs
    @nameframe = Nameframe.find_by_uuid(session[:uuid])
    nameframe_cost = @nameframe.calculate_cost
    shipping_cost = Checkout.shipping_cost(params[:shipping_country], params[:shipping_state], params[:shipping_type])

    tax_cost = Checkout.tax_cost(params[:shipping_country], params[:shipping_state], nameframe_cost)

    shipping_cost = 0 if shipping_cost.nil?
    tax_cost = 0 if tax_cost.nil?

    code = FreeNameframeCode.find_by_code(params[:how_did_you_hear_about_us])
---
SELECT * FROM `nameframes` WHERE (`nameframes`.`uuid` = 'e28195ce-1037-467b-b565-247247279523') LIMIT 1
SELECT * FROM `free_nameframe_codes` WHERE (`free_nameframe_codes`.`code` = 'rebe') LIMIT 1