app/controllers/orders_controller.rb

  def show_as_guest
    if session[:order_completed]
      session[:uuid] = nil
      session[:photo_customizations] = nil
      @order = Checkout.find(session[:order_completed].to_i)
---
SELECT * FROM `checkouts` WHERE (`checkouts`.`id` = 9)