app/controllers/users_controller.rb

SELECT * FROM `roles` WHERE (`roles`.`title` = 'user') LIMIT 1
---
  def create
    cookies.delete :auth_token
    # protects against session fixation attacks, wreaks havoc with
    # request forgery protection.
    # uncomment at your own risk
    # reset_session
    #    @user.password = params[:user][:password]
    @user = User.new(params[:user])
    @user.role = Role.find_by_title('user')